Revit 2027 API
ExternallyTaggedNonBRep.SetUsage Method
 Controls the usage of this ExternallyTaggedNonBRep.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetUsage(
	ExternallyTaggedNonBRepUsage usage
)
Public Sub SetUsage (
	usage As ExternallyTaggedNonBRepUsage
)
public:
void SetUsage(
	ExternallyTaggedNonBRepUsage usage
)
member SetUsage :
        usage : ExternallyTaggedNonBRepUsage -> unit
Parameters
usage ExternallyTaggedNonBRepUsage
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ExternallyTaggedNonBRep Class
Autodesk.Revit.DB Namespace